InformationRegisters/nsLog.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>nsLog</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УровеньЛога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.nsУровниЛога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/nsОбработкаОшибок/Ext/Module.bsl
Функция ЗаписатьОшибку(Событие, КонтекстОшибки = Неопределено) Экспорт
	Возврат РегистрыСведений.nsLog.ЗаписатьОшибку(Событие, КонтекстОшибки);
КонецФункции

Функция ЗаписатьИнформацию(Событие, КонтекстОшибки = Неопределено) Экспорт
	Возврат РегистрыСведений.nsLog.ЗаписатьИнформацию(Событие, КонтекстОшибки);
КонецФункции
